In [1]:
import pandas as pd

C:\Users\raghav.aggarwal\AppData\Local\Temp\ipykernel_12252\217833862.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [7]:
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
df= pd.DataFrame(data)
print(df)
df.insert(2,"Age",[21,22,23,24])
df

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

     Name  Height  Age Qualification
0     Jai     5.1   21           Msc
1  Princi     6.2   22            MA
2  Gaurav     5.1   23           Msc
3    Anuj     5.2   24           Msc

In [12]:
address = {'Jai': 'Dehli', 'Princi': 'Banglore',
           'Gaurav': 'Patna', 'Anuj': 'Chennai'}
df['Address']=address
df
# When you try to add the 'Address' column to the DataFrame using df['Address'] = address,
#  pandas attempts to match the keys in the address dictionary with the index (row labels) of the DataFrame. 
# Since there is no direct match, it fills the 'Address' column with NaN (Not a Number) values.

     Name  Height  Age Qualification Address
0     Jai     5.1   21           Msc     NaN
1  Princi     6.2   22            MA     NaN
2  Gaurav     5.1   23           Msc     NaN
3    Anuj     5.2   24           Msc     NaN

In [13]:
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']    
df['Address'] = address
print(df)

     Name  Height  Age Qualification    Address
0     Jai     5.1   21           Msc      Delhi
1  Princi     6.2   22            MA  Bangalore
2  Gaurav     5.1   23           Msc    Chennai
3    Anuj     5.2   24           Msc      Patna